Ran Plan for project: `vntechies-gitops` dir: `terraform/ap-southeast-1` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet4"] will be created
+ resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = "rtb-01d240c02fb6f1f20"
      + subnet_id      = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet4"] will be created
+ resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "thodung-vntechies-public_subnet4-ap-southeast-1c"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "public_subnet3"         = "ap-southeast-1c"
        }
      + tags_all                                       = {
          + "Name"                   = "thodung-vntechies-public_subnet4-ap-southeast-1c"
          + "component"              = "thodung"
          + "env"                    = "vntechies"
          + "github_repo"            = "github.com/vntechies/013-demo-gitops"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "project"                = "013-demo-gitops"
          + "public_subnet3"         = "ap-southeast-1c"
        }
      + vpc_id                                         = "vpc-05f67dec3e19597d3"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
~ subnet_ids = {
      ~ demo-vpc = {
          + public_subnet4 = (known after apply)
            # (3 unchanged attributes hidden)
        }
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vntechies-gitops`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.hungran.cloud:4141/lock?id=vntechies%252F013-demo-gitops%252Fterraform%252Fap-southeast-1%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vntechies-gitops`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`